In [78]:
from google.colab import drive
drive.mount('/content/gdrive/')

Drive already mounted at /content/gdrive/; to attempt to forcibly remount, call drive.mount("/content/gdrive/", force_remount=True).

In [79]:
DATAPATH=r"/content/gdrive/My Drive/DM_Lab/Prediction_dataset"

In [80]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy import stats
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.preprocessing import MinMaxScaler

In [81]:
price=pd.read_csv(f'{DATAPATH}/Housing.csv')

In [82]:
price.shape

(545, 13)

In [83]:
price

        price  area  bedrooms  ...  parking  prefarea furnishingstatus
0    13300000  7420         4  ...        2       yes        furnished
1    12250000  8960         4  ...        3        no        furnished
2    12250000  9960         3  ...        2       yes   semi-furnished
3    12215000  7500         4  ...        3       yes        furnished
4    11410000  7420         4  ...        2        no        furnished
..        ...   ...       ...  ...      ...       ...              ...
540   1820000  3000         2  ...        2        no      unfurnished
541   1767150  2400         3  ...        0        no   semi-furnished
542   1750000  3620         2  ...        0        no      unfurnished
543   1750000  2910         3  ...        0        no        furnished
544   1750000  3850         3  ...        0        no      unfurnished

[545 rows x 13 columns]

In [84]:
price.drop(['mainroad','guestroom','basement','hotwaterheating','airconditioning','prefarea'],axis=1,inplace=True)

In [85]:
price

        price  area  bedrooms  bathrooms  stories  parking furnishingstatus
0    13300000  7420         4          2        3        2        furnished
1    12250000  8960         4          4        4        3        furnished
2    12250000  9960         3          2        2        2   semi-furnished
3    12215000  7500         4          2        2        3        furnished
4    11410000  7420         4          1        2        2        furnished
..        ...   ...       ...        ...      ...      ...              ...
540   1820000  3000         2          1        1        2      unfurnished
541   1767150  2400         3          1        1        0   semi-furnished
542   1750000  3620         2          1        1        0      unfurnished
543   1750000  2910         3          1        1        0        furnished
544   1750000  3850         3          1        2        0      unfurnished

[545 rows x 7 columns]

In [86]:
price = price[['area', 'bedrooms', 'bathrooms', 'stories', 'parking','furnishingstatus','price']]

In [87]:
price

     area  bedrooms  bathrooms  stories  parking furnishingstatus     price
0    7420         4          2        3        2        furnished  13300000
1    8960         4          4        4        3        furnished  12250000
2    9960         3          2        2        2   semi-furnished  12250000
3    7500         4          2        2        3        furnished  12215000
4    7420         4          1        2        2        furnished  11410000
..    ...       ...        ...      ...      ...              ...       ...
540  3000         2          1        1        2      unfurnished   1820000
541  2400         3          1        1        0   semi-furnished   1767150
542  3620         2          1        1        0      unfurnished   1750000
543  2910         3          1        1        0        furnished   1750000
544  3850         3          1        2        0      unfurnished   1750000

[545 rows x 7 columns]

In [88]:
price['furnishingstatus'],_=pd.factorize(price['furnishingstatus'])

In [89]:
price

     area  bedrooms  bathrooms  stories  parking  furnishingstatus     price
0    7420         4          2        3        2                 0  13300000
1    8960         4          4        4        3                 0  12250000
2    9960         3          2        2        2                 1  12250000
3    7500         4          2        2        3                 0  12215000
4    7420         4          1        2        2                 0  11410000
..    ...       ...        ...      ...      ...               ...       ...
540  3000         2          1        1        2                 2   1820000
541  2400         3          1        1        0                 1   1767150
542  3620         2          1        1        0                 2   1750000
543  2910         3          1        1        0                 0   1750000
544  3850         3          1        2        0                 2   1750000

[545 rows x 7 columns]

In [90]:
X = price.iloc[:,:-1]
y = price.iloc[:,-1:]

In [91]:
X

     area  bedrooms  bathrooms  stories  parking  furnishingstatus
0    7420         4          2        3        2                 0
1    8960         4          4        4        3                 0
2    9960         3          2        2        2                 1
3    7500         4          2        2        3                 0
4    7420         4          1        2        2                 0
..    ...       ...        ...      ...      ...               ...
540  3000         2          1        1        2                 2
541  2400         3          1        1        0                 1
542  3620         2          1        1        0                 2
543  2910         3          1        1        0                 0
544  3850         3          1        2        0                 2

[545 rows x 6 columns]

In [92]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.3)

In [93]:
lm = LinearRegression()
lm.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [94]:
y_pred = lm.predict(X_test)

In [95]:
lm.score(X_test,y_test)

0.514369833610744

In [96]:
from sklearn.metrics import r2_score 
r2_score(y_test,y_pred)

0.514369833610744

In [97]:
lm.predict([[7420,4,2,3,2,0]])

array([[7900294.93005221]])

In [99]:
import pickle
# PATH=r"/content/gdrive/My Drive/DM_Lab/Prediction_dat"
pickle.dump(lm,open(f'{DATAPATH}/House_Price_Pred.pkl','wb'))